[
    {
        "date": " 2024-11-28",
        "content": "\nThis is a 60 minute session focused on building strength, stamina, power and speed through\n\t\t\t\t\t\t\tinterval-based training.\nThis session is lead by fully-qualified run coach Dan, Rik and/or George. The 60 minutes\n\t\t\t\t\t\t\tinclude a thorough warm up consisting of easy running, mobilisation work, dynamic\n\t\t\t\t\t\t\tstretching, drills and strides. This warm up also focuses on improving various aspects of\n\t\t\t\t\t\t\trun technique, biomechanics and efficiency. Not only will interval training improve your\n\t\t\t\t\t\t\tperformance at all distances but it’s a really fun and social way to train. Anyone and\n\t\t\t\t\t\t\teveryone can benefit from interval-training regardless of experience level or goals. The\n\t\t\t\t\t\t\tcoaches are on hand throughout to answer questions or help you tailor the session to suit\n\t\t\t\t\t\t\tyour own ability.\nThe main set is usually interval-based, meaning that there is some faster-paced running for a\n\t\t\t\t\t\t\tset time or distance, interspersed with recovery which is either easy jogging, walking or\n\t\t\t\t\t\t\tstanding. The aim of each interval session is to improve a certain aspect of our physiology,\n\t\t\t\t\t\t\tsuch as our pace at Lactate Threshold, Vo2 Max or increase our Running Economy and\n\t\t\t\t\t\t\tNeuromuscular Efficiency.\nThese sessions are also individualised for each attendee as we regularly carry out 3k and 5k\n\t\t\t\t\t\t\ttime trials (or use a recent race result) to ascertain pace zones for different running\n\t\t\t\t\t\t\tintensities. This allows you to run at the right effort and avoid overexerting and\n\t\t\t\t\t\t\tovertraining.\nThe first session is free and all subsequent sessions are £5, unless you are a member\n\t\t\t\t\t\t\tof the Rock n Road Runners run club. If you would like to join the club click here or email [email protected] for\n\t\t\t\t\t\t\tmore info.\nTHIS WEEKS SESSION – COACH: Dan Garrido\n\nSession Focus: Improving speed and endurance\n\t\t\t\t\t\t\t\t\tthrough VO2 max intervals and fast, controlled efforts.\nSession Breakdown\nWarm-Up-Easy running: 3-5 minutes at a relaxed pace to get the body\n\t\t\t\t\t\t\t\tmoving.-Dynamic stretches\nMain Session\nPart 1: 4 × 30-Second Fast Efforts (6 minutes)\n– Goal: Controlled speed.\n– Structure: 30 seconds hard running at speed form (approx 8/10 effort, or best\n\t\t\t\t\t\t\t\tmile pace) followed by 60 seconds rest. Repeat for 6 minutes (4 reps).\nPart 2: 800m Repeats at VO2 Max (30 minutes)\n– Goal: Run hard but sustainable intervals (6 -7 out of 10 effort) at a pace close\n\t\t\t\t\t\t\t\tto your 3k-5k race pace.– Structure: Complete as many 800m reps as you can fit\n\t\t\t\t\t\t\t\tinto 30 minutes – you should be able to complete at least one more rep than you\n\t\t\t\t\t\t\t\tdid last week– Recovery: Take 90 seconds of static rest between each interval.\n\t\t\t\t\t\t\t\nTips:– Pace yourself: Start conservatively to maintain\n\t\t\t\t\t\t\t\tconsistency across all reps.– Focus on effort: everyone should aim for their\n\t\t\t\t\t\t\t\tpersonal VO2 max pace.– Run with good form: Keep your arms driving, your core\n\t\t\t\t\t\t\t\tengaged, and stay relaxed as you push the pace.– Effort-based approach: Focus\n\t\t\t\t\t\t\t\ton what feels fast and controlled ‘for you’, regardless of others’\n\t\t\t\t\t\t\t\tspeeds.\nCool-Down (5 minutes)Jog: 5 minutes of easy running to let the\n\t\t\t\t\t\t\t\tbody recover.\nWhy This Session Works\n– The 30-second efforts will fire up the central nervous system, spike heart rate\n\t\t\t\t\t\t\t\tand create some lactate build up to induce fatigue prior to starting the VO2\n\t\t\t\t\t\t\t\tefforts– The 800m intervals help build aerobic capacity and push your body to\n\t\t\t\t\t\t\t\tadapt to higher-intensity running.\n\n\n \n\n*Please note: Both club members and guests attending these group runs,\n\t\t\t\t\t\t\t\t\tacknowledge and accept that playing or participating in sport of any kind can be\n\t\t\t\t\t\t\t\t\tdangerous and may result in injury and damage to property. Members and guests shall\n\t\t\t\t\t\t\t\t\ttake personal responsibility for their own actions and play or participate in the\n\t\t\t\t\t\t\t\t\tClub’s sporting activities at their own risk*\n"
    },
    {
        "date": " 2024-12-05",
        "content": "This is a 60 minute session focused on building strength, stamina, power and speed through interval-based training.\nThis session is lead by fully-qualified run coach Dan, Rik and/or George. The 60 minutes include a thorough warm up consisting of easy running, mobilisation work, dynamic stretching, drills and strides. This warm up also focuses on improving various aspects of run technique, biomechanics and efficiency. Not only will interval training improve your performance at all distances but it’s a really fun and social way to train. Anyone and everyone can benefit from interval-training regardless of experience level or goals. The coaches are on hand throughout to answer questions or help you tailor the session to suit your own ability.\nThe main set is usually interval-based, meaning that there is some faster-paced running for a set time or distance, interspersed with recovery which is either easy jogging, walking or standing. The aim of each interval session is to improve a certain aspect of our physiology, such as our pace at Lactate Threshold, Vo2 Max or increase our Running Economy and Neuromuscular Efficiency.\nThese sessions are also individualised for each attendee as we regularly carry out 3k and 5k time trials (or use a recent race result) to ascertain pace zones for different running intensities. This allows you to run at the right effort and avoid overexerting and overtraining.\nThe first session is free and all subsequent sessions are £5, unless you are a member of the Rock n Road Runners run club. If you would like to join the club click here or email [email protected] for more info.\nTHIS WEEKS SESSION – COACH: Dan Garrido\n\nSession Focus: Improving speed and endurance through VO2 max intervals and fast, controlled efforts.\nSession Breakdown\nWarm-Up-Easy running: 3-5 minutes at a relaxed pace to get the body moving.-Dynamic stretches\nMain Session\nPart 1: 4 × 30-Second Fast Efforts (6 minutes)\n– Goal: Controlled speed.\n– Structure: 30 seconds hard running at speed form (approx 8/10 effort, or best mile pace) followed by 60 seconds rest. Repeat for 6 minutes (4 reps).\nPart 2: 800m Repeats at VO2 Max (30 minutes)\n– Goal: Run hard but sustainable intervals (6 -7 out of 10 effort) at a pace close to your 3k-5k race pace.– Structure: Complete as many 800m reps as you can fit into 30 minutes – you should be able to complete at least one more rep than you did last week– Recovery: Take 90 seconds of static rest between each interval.\nTips:– Pace yourself: Start conservatively to maintain consistency across all reps.– Focus on effort: everyone should aim for their personal VO2 max pace.– Run with good form: Keep your arms driving, your core engaged, and stay relaxed as you push the pace.– Effort-based approach: Focus on what feels fast and controlled ‘for you’, regardless of others’ speeds.\nCool-Down (5 minutes)Jog: 5 minutes of easy running to let the body recover.\nWhy This Session Works\n– The 30-second efforts will fire up the central nervous system, spike heart rate and create some lactate build up to induce fatigue prior to starting the VO2 efforts– The 800m intervals help build aerobic capacity and push your body to adapt to higher-intensity running.\n\n\n \n\n*Please note: Both club members and guests attending these group runs, acknowledge and accept that playing or participating in sport of any kind can be dangerous and may result in injury and damage to property. Members and guests shall take personal responsibility for their own actions and play or participate in the Club’s sporting activities at their own risk*"
    }
]